Did some local tests and it appears to be working as intended:
```
Terraform will perform the following actions:

  # google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id = "test-account"
      + disabled   = false
      + email      = "test-account@my-project-id.iam.gserviceaccount.com"
      + id         = (known after apply)
      + member     = "serviceAccount:test-account@my-project-id.iam.gserviceaccount.com"
      + name       = (known after apply)
      + project    = "my-project-id"
      + unique_id  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```